# ViewScaleHavename Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewScaleHavename Property
ParameterTypeId Class See Also
---
"Display Name"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewScaleHavename { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewScaleHavename As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewScaleHavename {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace